<template>
    <div class="container-fluid">
        <div class="container">
            <img class="herzel" src="../../static/herzel_black.png">
            <h2>Terms and Conditions</h2>
            <!--<div class="row flags">-->
                <!--<div class="flag-icon"><img @click="toggleEnglish" src="../../static/united-states.png"></div>-->
                <!--<div class="flag-icon"><img @click="toggleHebrew" src="../../static/israel.png"></div>-->
            <!--</div>-->
            <transition mode="out-in" enter-active-class="animated fadeIn" leave-active-class="animated fadeOut">
                <!--english section-->
                <div :key="1" v-if="isEnglish" class="row">
                    <div class="col-lg-12">
                        <h5><strong>Headling for terms section</strong></h5>
                        <h6><strong>Sub-Headling for terms section</strong></h6>
                        <p>Lorem ipsum dolor sit amet, oratio melius audire pri et, in appetere vituperata vim, ex eirmod incorrupte quaerendum cum. Debet viderer phaedrum ius in, malorum rationibus ei sea. Et pri soluta iuvaret neglegentur, facilis voluptatum nam cu. Nam volumus eligendi incorrupte no, adversarium concludaturque ad vix.</p>
                        <p>Id vis sale magna intellegat. Sit id fastidii delectus reprimique. Clita salutandi reprehendunt at est, ius no summo accusamus, suas eius possim cu per. Ut quis alterum admodum sit. Ad eam rebum facilisi delicata, at dico accommodare eos. Et singulis adolescens pro, no per tractatos philosophia. Ad ius diceret referrentur, eu eam eruditi voluptua.</p>
                        <p>Offendit invidunt platonem mei ad, et wisi omnesque adversarium sea. Unum impedit sit in. Ut vim discere adolescens. Vel facer aeque impetus in, qui no epicurei indoctum salutandi, has eu posse graece.</p>
                        <p>Ex mazim sapientem scribentur ius, his ei ipsum atomorum, diam dicta eum te. Omittam eloquentiam ei eos, nihil ubique sed ex. Suas doming meliore an cum, ne sed suscipit apeirian. Quo ignota vocibus ea, magna blandit propriae ad vix, tation accommodare mea ex. Nec ut malorum nonumes atomorum.</p>
                        <p>Mel hinc inermis tibique ei, regione dissentiet in has. Eu verear suscipit duo. Tempor percipitur vel in. Te sit ponderum quaerendum.</p>
                        <p>Te corpora intellegat quo. Ad qui dolores percipitur, fuisset epicuri cu per, ius petentium gloriatur at. His iudico repudiare id, illum maluisset an mel. Per an viris laudem, in solum facilisis contentiones vel. Mei ne tota incorrupte, oportere elaboraret ius cu. Ex sit mundi nihil putant, fugit mollis ad vis, vis ponderum torquatos persequeris te.</p>
                    </div>
                </div>

                <!--hebrew section-->
                <div :key="2" v-else class="row heb">
                    <div class="col-lg-12">
                        <p class="disclaimer"><strong>*</strong> English version of the Participation Agreement will be added soon.</p>
                        <h4>HackIDC 2019 - הסכם משתתפים</h4>
                        <h5>מבוא</h5>
                        <ol>
                            <li>בית ספר אפי ארזי למדעי המחשב – המרכז הבינתחומי הרצליה בשיתוף עם אגודת הסטודנטים – המרכז הבינתחומי (להלן בהתאמה: "בית הספר", "האגודה" וביחד: "עורכות התחרות") עורכות תחרות נושאת פרסים בין סטודנטים מישראל, כהגדרתם להלן אשר עניינה פיתוח מוצר תוכנה מקורי הקשור ליזמות בכל תחום שהוא (להלן: "המוצר"), במסגרת מרתון אשר יימשך עד 36 שעות (להלן: "התחרות").</li>
                            <li>תקנון זה מהווה הסכם בין המשתתפים בתחרות, כהגדרתם להלן, לבין עורכות התחרות, וכל משתתף אשר נרשם לתחרות בהתאם לתקנון זה וכפי שיפורט להלן, יראוהו כמי שקיבל על עצמו את תנאי תקנון זה ככתבתם וכלשונם והביע את הסכמתו להם.</li>
                            <li>תקנון זה מתפרסם באתר האינטרנט של התחרות בכתובת www.hackidc.com (להלן: "אתר התחרות").</li>
                        </ol>
                        <h5>תנאי ההשתתפות בתחרות ואופן ההרשמה</h5>
                        <ol start="4">
                            <li>נרשם חוקי לתחרות הינו סטודנט, הלומד במוסד אקדמאי מוכר בישראל לשנת הלימודים תשע"ח, אשר נרשם לתחרות באתר התחרות ואישר במקום המתאים בדף ההרשמה באתר התחרות, כי קרא תקנון זה. במסגרת ההרשמה יידרש כל נרשם  טרם תחילת התחרות להציג אישור לימודים עדכני מהמוסד האקדמי בו הוא לומד עבור שנת הלימודים הנוכחית וקורות חיים (להלן: "נרשם" ובהתאמה: "נרשמים"). למען הסר ספק, הרישום הוא על בסיס אישי.</li>
                            <li>ההרשמה לתחרות אינה מהווה אישור או הבטחה להשתתפות בתחרות, אך מהווה תנאי להשתתפות בתחרות.</li>
                            <li> ההרשמה לתחרות תחל בתאריך 16.12.18 ותינעל בתאריך 08.03.18 (להלן: "תקופת ההרשמה").</li>
                            <li>עורכות התחרות רשאיות להאריך את תקופת ההרשמה לתחרות על פי שיקול דעתן הבלעדי (להלן: "התקופה המוארכת") בדרך של פרסום באתר התחרות ובעמוד הפייסבוק של התחרות.</li>
                            <li>נרשם לתחרות ייחשב כמי שהסכים כי קורות החיים שלו ו/או כל פרט מפרטיו האישיים כפי שמסר אותם לעורכות התחרות יועברו אל עורכות התחרות ו/או למי מטעמן, לרבות שופטי התחרות והמנטורים ו/או למחלקות משאבי אנוש בחברות אשר מעניקות את החסות לתחרות וכן כמי שהסכים כי חברות כאמור יפנו אליו בהצעות תעסוקה ו/או אחרות.</li>
                            <li>נרשם לתחרות ייחשב כמי שהסכים כי כל תצלום או סרטון הכולל את דמותו וקולו, כפי שעשויים להיות מצולמים ו/או מוקלטים במהלך התחרות, ו/או שמו ופרטים אישיים אחרים שסופקו בהרשמה לתחרות, יתפרסמו על ידי עורכות התחרות בחלקם או במלואם, עם/מבלי לציין את שמו, בכל כלי תקשורת ו/או בכל אמצעי פרסום אחר, לרבות (אך לא רק) אתר התחרות ו/או עמוד הפייסבוק של התחרות ו/או עמוד הפייסבוק של בית הספר ו/או כל פרסום של האגודה בהתאם לשיקול דעת עורכות התחרות, וזאת מבלי לגרוע מהסכמתו לכל יתר תנאי תקנון זה. מובהר כי תנאי זה מהווה תנאי מקדים שאין בלתו לעצם ההשתתפות בתחרות, ונרשם אשר שלח פרטיו האישיים לצורך השתתפות בתחרות נשוא תקנון זה, יראוהו כמי שקיבל על עצמו מראש תנאי זה.</li>
                            <li>ההשתתפות בתחרות יכול שתעשה על בסיס אישי או בצוותים הכוללים עד חמישה נרשמים, כפי שיפורט להלן.</li>
                            <li>בתום תקופת ההרשמה (לרבות התקופה המוארכת), יבחנו נציגים מטעם עורכות התחרות את פרטי הנרשמים, לרבות הפרטים על ניסיון הנרשמים בתחומים הרלוונטיים. עורכות התחרות רשאיות (אך לא חייבות) לזמן לראיון ו/או להפנות שאלות לנרשמים (לרבות נרשמים ספציפיים) בטרם אישור השתתפותם בתחרות, על פי שיקול דעתן הבלעדי (להלן: "תהליך המיון").</li>
                            <li>בתום תהליך המיון, תימסר לכל אחד מהנרשמים הודעה אישית, אשר יצויין בה אם עורכות התחרות אישרו את השתתפותו בתחרות או לא. הודעה על אישור השתתפות תימסר באמצעות הטלפון ו/או המייל (להלן: "הודעה מאשרת"). משתתף ייחשב מי שנרשם לתחרות, קיבל הודעה מאשרת מעורכות התחרות ואישר במייל חוזר את השתתפותו בתחרות (להלן: "נרשם משתתף",  ובהתאמה:  "נרשמים משתתפים").</li>
                            <li>הנרשם המשתתף מצהיר ומתחייב כי הקוד וכן כל מידע ו/או תוכן אחר אשר יעשה בהם שימוש לפיתוח המוצר במסגרת התחרות הינם מקוריים וכי הם נכתבו ו/או נוצרו במהלך התחרות על ידי הנרשם המשתתף ו/או הצוות שלו.</li>
                            <li>הנרשם המשתתף מצהיר ומתחייב כי המוצר, אשר יפתח בעצמו או ביחד עם נרשמים משתתפים אחרים הינו מוצר מקורי, לרבות מבחינת הרעיון שעומד מאחורי המוצר והביטוי של הרעיון בקוד.</li>
                            <li>הנרשם המשתתף מצהיר ומתחייב כי לא יעשה כל שימוש במסגרת השתתפותו בתחרות בקוד ו/או תוכנה ו/או יישום, באופן אשר מפר זכויות של צד שלישי (לרבות בכל הנוגע לשימוש בקוד פתוח הכפוף לרישיונות צד שלישי אותם מתחייב הנרשם המשתתף לכבד במלואם) ומתחייב לשפות את עורכות התחרות בגין כל טענה ו/או דרישה ו/או תביעה אשר תופנה כלפיהן בקשר עם הפרת זכויות צד שלישי מיד עם דרישתן הראשונה.</li>
                            <li>נרשמים משתתפים בתחרות לא יורשו להשתמש בקוד מוכן, אשר נכתב ו/או נערך במועד מוקדם למועד תחילת התחרות. נרשמים משתתפים יוכלו לעבוד עם קוד אשר נכתב במהלך התחרות בלבד. נרשם משתתף אשר ימצא, בשלב כלשהו של התחרות, משתמש בקוד אשר נכתב לפני התחרות יפסל מידית ביחד עם כל הצוות שלו ויהיה חייב לעזוב את מקום התחרות לאלתר.</li>
                            <li>כל נרשם משתתף  בתחרות (ובהתאמה צוות משתתף בתחרות) יהיה בעל זכויות היוצרים במוצר ו/או ברעיון אשר יפותח ו/או ייוצר על ידו במהלך התחרות. נרשם לתחרות ייחשב כמי שהסכים, כי ככל שהשתתפותו בתחרות תיעשה בצוות של מספר נרשמים משתתפים (להלן: "צוות") יהיו זכויות היוצרים במוצר בבעלות משותפת של כל חברי הצוות ללא קשר למידת תרומתם לכתיבת הקוד ו/או יצירת המוצר.</li>
                            <li>עורכות התחרות רשאיות לפסול ו/או להוציא משתתפים או צוותים מהתחרות בכל שלב במידה ולא מילאו אחר כלל התנאים המפורטים בתקנון זה במלואם ובמועדם ו/או במידה ועל פי שיקול דעתן המלא של עורכות התחרות נרשם או משתתף או נרשמים משתתפים ו/או צוותים משתתפים ביצעו מעשה אחר אשר אינו ראוי, אינו אתי, אינו חוקי או סותר בכל דרך אחרת את רוח התחרות ו/או לא כיבדו ו/או פגעו בזכויות של כל נרשם משתתף אחר. למען הסר ספק,  עורכות התחרות יהיו רשאיות לשלול זכייה מנרשם משתתף ו/או מצוות באופן רטרואקטיבי. החלטתן של עורכות התחרות תהיה סופית, מוחלטת ובלתי ניתנת לערעור.</li>
                        </ol>
                        <h6>התחרות</h6>
                        <ol start="19">
                            <li>התחרות תיערך בין התאריכים 11.04.19 עד 12.04.19 בקמפוס המרכז הבינתחומי הרצליה.</li>
                            <li>עורכות התחרות רשאיות לשנות את שעות וימי התחרות על פי שיקול דעתן הבלעדי.</li>
                            <li>סדר היום לכל אחד מימי התחרות יפורסם באתר התחרות. לוח הזמנים הסופי של התחרות יימסר לנרשמים המשתתפים במועד פתיחת התחרות.</li>
                            <li>במהלך התחרות יפעלו שני צוותי שיפוט: משני וראשי. צוות השופטים המשני יבחר מספר נרשמים משתתפים/צוותים מבין כלל הנרשמים המשתתפים אשר יעלו לגמר. צוות השופטים הראשי יבחר מבין הנרשמים המשתתפים/צוותים אשר עלו לגמר, את הנרשמים המשתתפים/הצוותים הזוכים בתחרות (למען הסר ספק, מספר העולים לגמר/הזוכים נתון לשיקול דעת עורכות התחרות).</li>
                            <li>עורכות התחרות רשאיות לערוך שינויים בצוות השופטים על פי שיקול דעתן הבלעדי ובהתאם לאילוצים אשר יתהוו, ככל שיתהוו.</li>
                            <li>השופטים רשאים להעלות לגמר ו/או להעניק את הזכייה בתחרות לנרשם משתתף או לצוות, וכן רשאים לקבוע זכיה משותפת.</li>
                            <li>צוותי השופטים רשאים להעניק פרסים נוספים גם לנרשמים משתתפים ו/או צוותים, אשר אינם נמנים על אחד מהמקומות הזוכים, על פי שיקול דעתם והתרשמותם הכללית של השופטים מאותם נרשמים משתתפים ו/או צוותים, אופן תפקודם במהלך התחרות והמוצר אשר פיתחו.</li>
                            <li>הזוכים בתחרות יהיו הנרשמים המשתתפים ו/או צוותים אשר צוות השופטים מצא כי המוצר אשר פיתחו במסגרת התחרות עונה באופן אופטימלי לקריטריונים של יצירתיות וחדשנות.</li>
                        </ol>
                        <h5>אופן עריכת התחרות</h5>
                        <ol start="27">
                            <li>מהלך התחרות יהיה כדלקמן:
                                <ol>
                                    <li>במועד פתיחת התחרות יתכנסו המשתתפים לצורך רישום.</li>
                                    <li>בתום הרישום תיערך פתיחה רשמית של התחרות במסגרתה יועבר תדרוך מרוכז לכל הנרשמים המשתתפים בקשר עם כללי התחרות ולוח הזמנים.</li>
                                    <li>לאחר טקס פתיחה תוכרז תחילת התחרות.</li>
                                    <li>מרגע ההכרזה על תחילת התחרות יוכלו הנרשמים המשתתפים להתחיל לעבוד על הרעיון שלהם.</li>
                                    <li>במהלך התחרות יוכלו הנרשמים המשתתפים להיוועץ עם אנשי מקצוע אשר ימצאו במקום מטעם עורכות התחרות. אין להיעזר ביועצים חיצוניים אשר אינם במקום מטעם עורכות התחרות.</li>
                                    <li>עורכות התחרות יכריזו על המועד בו יש לסיים את העבודה ("תום העבודה").</li>
                                    <li>מרגע ההכרזה על תום העבודה לא יורשו המתמודדים להמשיך לעבוד על המוצר אלא רק על הכנות להצגתו.</li>
                                    <li>לאחר סבב הצגה ראשוני, בפני צוות שופטים משני, ייבחרו נרשמים משתתפים/צוותים להציג את המוצר שלהם בפני צוות השופטים הראשי.</li>
                                    <li>במהלך טקס הסיום יציגו הנרשמים המשתתפים/הצוותים הנבחרים את המוצר בפני צוות השופטים הראשי ובפני שאר הנרשמים המשתתפים.</li>
                                    <li>בתום ההצגה, יקיים צוות השופטים התייעצות, בתומה יוכרזו המנצחים בתחרות.</li>
                                </ol>
                            </li>
                            <li>התחרות תתנהל בכפוף ללוח הזמנים אשר יוצג למשתתפים במועד פתיחת התחרות. עורכות התחרות שומרות לעצמן את הזכות לערוך שינויים בלוחות הזמנים של התחרות על פי שיקול דעתן הבלעדי.</li>
                        </ol>
                        <h5>פרסום תוצאות התחרות, הפרסים ואופן מימוש הזכייה</h5>
                        <ol start="29">
                            <li>הזוכים בתחרות יוכרזו בטקס סיום התחרות ביום 12-04-19.</li>
                            <li>כל נרשם משתתף אשר שלח את הודעת הדוא"ל לצורך ההרשמה לתחרות כאמור בתקנון זה לעיל ולהלן, מקבל על עצמו כי קרא תנאי תקנון זה ומסכים במפורש לכך שבעת קבלת הפרס, ככל שיזכה בכזה, הוא יצולם על ידי עורכות התחרות ו/או מי מטעמן ותמונתו ממעמד הזכייה תפורסם בכל אמצעי מדיה, בכל מקום וזמן, לפי שיקול דעתן הבלעדי של עורכות התחרות, ולרבות עמוד הפייסבוק ו/או אתר האינטרנט של התחרות ו/או האגודה ו/או המרכז הבינתחומי הרצליה ו/או בית הספר.</li>
                            <li>סכומי הפרסים לזוכים ייקבעו לאחר סיום שלב ההרשמה על פי שיקול דעת עורכות התחרות. תיתכן חלוקת פרסים נוספים לנרשמים משתתפים אשר אינם נמנים על אחד מהמקומות הזוכים.</li>
                            <li>במידה והזוכה הינו צוות, יחולק סכום הזכייה באופן שווה בין הנרשמים המשתתפים הנמנים על הצוות.</li>
                            <li>הפרסים ימסרו לנרשמים המשתתפים במסירה אישית, בהמחאה על שמם, בתוך 30 ימים ממועד הודעת הזכייה, בהתאם למועד אשר יתואם עמם מראש טלפונית על ידי עורכות התחרות, ובכפוף להצגת תעודה מזהה במועד המסירה.</li>
                            <li>הפרס הינו אישי ואינו ניתן להעברה.</li>
                            <li>עורכות התחרות שומרות לעצמן את הזכות לעכב ו/או לבטל את מסירת הפרס, מכל סיבה אשר יש בה עפ"י דין לעכב או לבטל את מסירתו.</li>
                        </ol>
                        <h5>כללי</h5>
                        <ol start="36">
                            <li>תוצאות התחרות הן סופיות, מוחלטות ובלתי ניתנות לערעור.</li>
                            <li>עורכות התחרות רשאיות לדחות ו/או להאריך כל מועד הקבוע בתקנון זה. בנוסף עורכות התחרות רשאיות לבטל או להפסיק תחרות זו, בכל עת, מחמת תקלה ו/או טעות ו/או מחמת גורמים שאינם תלויים בהן, אשר לא יאפשרו את קיום התחרות, ו/או את חלקה, בהתאם לאמור בתקנון זה, או יחייבו את דחייתה.</li>
                            <li>עורכות התחרות לא יהיו אחראיות באופן כלשהו לכל טעות או תקלה בגינה לא נקלטה בקשת נרשם להירשם לתחרות ו/או תימנע ההשתתפות ממי שזכאי להשתתף בתחרות ו/או בגינה תמנע ממנו האפשרות לקבל את הפרס.</li>
                            <li>עורכות התחרות רשאיות לתקן תקנון זה, בכל עת על ידי פרסום הודעה באתר התחרות. על כל נרשם משתתף לעקוב בעצמו אחרי הפרסומים באתר. לא יישלחו הודעות אישיות על שינויים.</li>
                            <li>הניסוח בלשון זכר הינו מטעמי נוחות בלבד והוא מתייחס כמובן לנשים וגברים.</li>
                        </ol>
                    </div>
                </div>
            </transition>
        </div>
    </div>
</template>

<script>
export default {
  data() {
    return {
      isEnglish: false
    }
  },
  methods: {
    toggleEnglish() { this.isEnglish = true; },
    toggleHebrew() { this.isEnglish = false; }
  }
}
</script>

<style scoped>
    .animated { animation-duration: .3s; }
    .container-fluid {
        margin-top: 3rem;
        padding: 8rem 0;
        min-height: 1000px;
        background-color: #f7f7f7;
    }
    .container {
        display: flex;
        flex-direction: column;
        align-items: center;
        justify-content: center;
    }
    .herzel {
        width: 10%;
        margin-bottom: 2rem;
    }
    h5, h6 { font-weight: bold; }
    .heb { direction: rtl; text-align: right; }
    .heb .disclaimer { direction: ltr !important; text-align: center !important; }
    h4 { font-size: 1.3rem; margin-bottom: 2rem; text-align: center; font-weight: bold; }
    .heb h5 { font-size: 1.1rem; }
    .heb h6 { font-size: 1rem;  }
    .heb ol li { padding-right: 1rem; margin-top: .5rem; font-size: .9rem; }
    h2 {font-weight: bold; margin-bottom: 4rem; text-align: center;}
    .row.flags {
        display: flex;
        flex-direction: row;
        justify-content: center;
        margin-bottom: 3rem;
    }
    .flag-icon {
        padding: 0 .5rem;
        flex-basis: 7%;
        cursor: pointer;
    }
    .flag-icon img { width: 100%; }

    @media screen and (max-width: 1440px) and (min-width: 1201px) {
        .container {width: 75%;}
    }

    @media screen and (max-width: 1200px) {

    }

    @media screen and (max-width: 767px) {
        ol li ol { padding: .5rem; }
        .herzel {width: 20%;}
        .flags { margin-bottom: 1rem; }
        .flag-icon { flex-basis: 15%; }
    }

    @media screen and (max-width: 380px) {

    }
</style>